import telebot  #модуль для работы с Telegram
import random #рандом для случайных ответов

#содержит вопросы и ответы на них
answers = {"Привет":["Привет!", "Привет"],
"Как дела?":["Нормально! А у тебя?", "Хорошо"],
"Отлично":["Замечательно!", "Супер"],
"Что делать, если":["Если что?", "?"],
"Стоп!":["Не так написал! Я не закроюсь.", "Не стоп!"],
"Где ты?":["Тут!", "Там"],
"Ты захватишь мир?":["Я уже это делаю!", "Нет!"],
"Сколько тебе лет?":["Много!", "0"],
"Что делаешь":["Пишу?", "Пишу"],
"Что?":["Что?", "Ничего"],
"Сколько будет 2 + 2":["5", "4"],
"...":["...", "............................"],
"Что молчишь?":["Это ты молчишь!", "Ничего"],
"":["", ""],}

bot = telebot.TeleBot("1412290075:AAEsV0JhDOvpavkrZJhYncu3QTSAlbRFTW0") #токен бота

@bot.message_handler(content_types=['text'])
def chatbot(message): #функция для работы бота
    get_question = message.text #заносим сообщение переменную
    getQuestion = answers.get(get_question) #ищем вопрос в answers
    if getQuestion: #если находим заносим ответ в переменную
        answer = getQuestion[random.randint(0, 1)]
    else:
        answer = "Извините! Я вас не понимаю."
        print(get_question)
    bot.send_message(message.chat.id, answer) #отправляем ответ
    
bot.polling(none_stop = True) #активируем бот и делаем его работу бесконечной